[
  {
    "id": 98,
    "title": "My profile on iCodeThis",
    "shortDescription": "Juicy CSS stuff.",
    "fullDescription": "The idea is simple: you get a design, then you recreate it as accurately as you wish and make it as interactive as you want. If pixel perfection is your thing, you can strive for that, but you can also take a creative approach and use the design as inspiration. It's a great site for practicing and showcasing what you already know.",
    "urlSite": "https://icodethis.com/veelcheck",
    "urlCode": "",
    "tags": ["iCodeThis", "Tailwind", "JavaScript"]
  },
  {
    "id": 10,
    "title": "Soba Ramen App",
    "shortDescription": "The final assignment for the Front-end Developer training, WORK-ON 7. Authors: Inga Pawelec, Żaklina Jasińska, Agnieszka Wilczek",
    "fullDescription": "Soba Ramen is an application for a fictional restaurant that allows users to: log in to a table using a code or a QR code, choose ramen ingredients and place an order, send a message via contact form and view admin panel (if! you know the password). Backend: Supabase database.",
    "urlSite": "https://soba-ramen.netlify.app/",
    "urlCode": "https://github.com/charldll/shushi",
    "tags": ["Tailwind", "React", "JavaScript"]
  },
  {
    "id": 9,
    "title": "Lego Shelf",
    "shortDescription": "CURRENTLY IN DEVELOPMENT. A project built with Next.js, designed to help LEGO enthusiasts manage their collections easily.",
    "fullDescription": "Lego Shelf is a project built with Next.js, designed to help LEGO enthusiasts (my six-and-a-half-years-old son) manage their LEGO collections easily. Inspired by the goal of creating a fun and simple platform for a young audience, this application allows users to look up LEGO sets and will eventually enable them to build a personalized digital LEGO library. The application is in its early stages, with basic functionality implemented. At this stage, you can search for LEGO sets by their set number using the Rebrickable API.",
    "urlSite": "https://legoshelf.netlify.app/",
    "urlCode": "https://github.com/veelcheck/LEGOshelf?tab=readme-ov-file",
    "tags": ["TypeScript", "Tailwind", "React"]
  },
  {
    "id": 8,
    "title": "TypeScript By Trial and Error",
    "shortDescription": "Small projects to practice TypeScript.",
    "fullDescription": "This is an ongoing project where I tackle small tasks to improve my TypeScript skills and practice React, exploring features I haven't yet used in larger projects. It's like my virtual notepad, helping me accelerate my learning and showcase my progress and growth to the world.",
    "urlSite": "https://typescriptfun.netlify.app/",
    "urlCode": "https://github.com/veelcheck/typescript-micro-projects",
    "tags": ["TypeScript", "Tailwind", "React"]
  },

  {
    "id": 7,
    "title": "Reddit Viewer",
    "shortDescription": "View Reddit with my redux app.",
    "fullDescription": "This project is a Reddit viewer application built in Vite, using React and Redux Toolkit. It allows users to browse Reddit content, search for specific terms, filter data based on predefined categories, and view detailed information about selected subreddits including the comment section.",
    "urlSite": "https://reddit-viewer-redux.netlify.app/",
    "urlCode": "https://github.com/veelcheck/reddit-viewer-redux/",
    "tags": ["Redux", "Tailwind", "React", "JavaScript"]
  },

  {
    "id": 1,
    "title": "First \"About Me\" Page",
    "shortDescription": "My first site, created from scratch, just so happens to be about myself!",
    "fullDescription": "This site marks my initial venture into creating a website from scratch, also serving as my first attempt at a personal \"About Me\" page. While it doesn't heavily rely on JavaScript, it does showcase a good deal of CSS. Take a moment to compare it with the site you're currently exploring, built with React and Tailwind. I feel it demonstrates some noteworthy progress in my web development journey.",
    "urlSite": "https://veelcheck.github.io/Agnieszka-Wilczek/",
    "urlCode": "https://github.com/veelcheck/Agnieszka-Wilczek",
    "tags": ["JavaScript", "CSS"]
  },
  {
    "id": 2,
    "title": "Second \"About Me\" Page",
    "shortDescription": "Just look around, you are already visiting this new page!",
    "fullDescription": "Guess what? I managed to assemble my homepage using React and Tailwind. Take a look around and feel free to compare it with my first one. If you're curious to delve into the code, be my guest!",
    "urlSite": "",
    "urlCode": "https://github.com/veelcheck/agnieszka-wilczek-personal-react",
    "tags": ["JavaScript", "CSS", "React", "Tailwind"]
  },
  {
    "id": 5,
    "title": "Jamming - music app",
    "shortDescription": "Powered by Spotify's API. Search for your favourite artist and add songs to the playlist.",
    "fullDescription": "Once you're on Spotify, my app makes it easy to find your favourite tunes and put together playlists to spice up your account. Built with React, it's user-friendly, responsive, and smoothly handles REST API tasks.",
    "tags": ["JavaScript", "React", "CSS", "RestAPI"],
    "urlCode": "https://github.com/veelcheck/jamming-music-app-react"
  },
  {
    "id": 3,
    "title": "Film Finder",
    "shortDescription": "EARLY BEGINNINGS. Find yourself a movie for the evening.",
    "fullDescription": "This project showcases the power of a REST API to present you with a randomly selected movie from your chosen genre on TMDB (The Movie Database). Through a simple click on the like or dislike button, you can create a list of movies you want to catch and those you'd rather skip. Initially started as a CodeCademy project with foundational code, but I took it up a notch, making the site responsive and fully functional. The technologies employed include JavaScript and CSS, providing a seamless and engaging user experience.",
    "urlSite": "https://veelcheck.github.io/film_finder_codecademy/",
    "urlCode": "https://github.com/veelcheck/film_finder_codecademy",
    "tags": ["JavaScript", "RestAPI", "CSS"]
  },
  {
    "id": 4,
    "title": "Credit Card Validator",
    "shortDescription": "EARLY BEGINNINGS. Check if a fake number matches the credit card algorithm.",
    "fullDescription": "This kicked off as a Codecademy project where you could test whether a solo number or a bunch of them are correct (NEVER EVER give anyone your actual credit card number!). I opted for focusing on individual numbers - if they are ok you get the logo of the company that supposedly handed out the card, if not my code provides a valid alternative.",
    "urlCode": "https://github.com/veelcheck/credit_card_checker",
    "tags": ["JavaScript", "CSS"]
  },

  {
    "id": 6,
    "title": "CSS Battle",
    "shortDescription": "EARLY BEGINNINGS. How I have fun with CSS challenges.",
    "fullDescription": "Have you ever tried CSS Battle? It's a blast! You can challenge yourself by creating shapes and become a CSS maestro. I personally enjoy this shape-forming game as a delightful and amusing way to kickstart a coding day. Check out a few of these shapes on my site for a sneak peek!    If you want to view it on your mobile device be sure your srceen is at least 400px wide.",
    "urlSite": "https://veelcheck.github.io/shapes/",
    "urlCode": "https://github.com/veelcheck/shapes",
    "tags": ["CSS"]
  },

  {
    "id": 99,
    "title": "GitHub",
    "shortDescription": "Feel free to check if I'm up to anything.",
    "fullDescription": "Feel free to see what I'm up to. While I might not update this site regularly, you can potentially find something new and exciting on my GitHub.",
    "urlSite": "https://github.com/veelcheck",
    "tags": [
      "JavaScript",
      "React",
      "CSS",
      "RestAPI",
      "Tailwind",
      "Redux",
      "TypeScript"
    ]
  }
]
